//npm - менеджер пакетов
//npm init ...
//npm install ...
//npm uninstall ...
//dev depensiv - npm i --save-dev ...

//_Node_JS
//Програмная платформа 
//Взаимодействия вводу выводу через api с++
//- простата
//- скорость
//- front и backend на 1 языке
//- богатый менеджер пакетов NPM

//_Концепции 
//Преобразует исходный код в  машинный код
//v8 -> Libuv (кросплатформенный ввод и вывод i/o и цикл событий) 
//Сложные математичсекие операции будут сложны node/js

//_Блокирующий ввод / вывод
//пока команда не выполнилась код дальше не пойдет
//15.11
